common/models/Court.php

    public function treeCourtsId($id){
        $courts = $this->find()->where(["up_level"=>$id])->asArray()->all();
---
SELECT * FROM `case_court` WHERE `up_level`='0'

    public function treeCourts($id){
        $courts = $this->find()->where(["up_level"=>$id])->all();
---
SELECT * FROM `case_court` WHERE `up_level`=0

    private function hasSubCourts($id){
        if($this->find()->where(["up_level"=>$id])->all()){
---
SELECT * FROM `case_court` WHERE `up_level`=1

    private function subTreeCourts($id){
        $courts = $this->find()->where(["up_level"=>$id])->all();
---
SELECT * FROM `case_court` WHERE `up_level`=1